cylinder/0/include/farfield
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

outer
{
   type            inletOutlet;
   inletValue      $internalField;
   value           $internalField;
}

// ************************************************************************* //
