cylinder/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    bottom
    {
        type            empty;
        inGroups        1(empty);
        nFaces          32135;
        startFace       57531;
    }
    top
    {
        type            empty;
        inGroups        1(empty);
        nFaces          32135;
        startFace       89666;
    }
    outer
    {
        type            patch;
        inGroups        1(farfield);
        nFaces          99;
        startFace       121801;
    }
    cylinder 
    {
        type            wall;
        inGroups        1(wall);
        nFaces          153;
        startFace       121900;
    }
)

// ************************************************************************* //
