cylinder/system/p_sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
type surfaces;
libs ("libsampling.so");
interpolationScheme cellPoint;
surfaceFormat raw;
// Fields to sample.
fields
(
    p 
);
surfaces
(
    cylinder 
    {
        type            patch;
        patches         ( "cylinder" );
        // Optional: whether to leave as faces (=default) or triangulate
        // triangulate     false;
    }
);
// *********************************************************************** //
