cylinder/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs ("libsampling.so");

//interpolationScheme cellPointFace;
//interpolationScheme cellPointWallModified;
interpolationScheme cellPoint;
//interpolationScheme cell;

setFormat       raw;

surfaceFormat raw;

// Fields to sample.
fields
(
    U
    wallShearStress
);

sets
(

    profile0						
    {							
	//type	lineCell;
	type	lineCellFace;					
	//axis 	xyz;	//distance; //y;	
	axis 	distance;

	start	( 0 0.5 0.5 );
	end     ( 0 0.6 0.5 );				
    }							
/*
    profile1						
    {							
	//type	midPoint;
	//type	midPointAndFace;			
	//axis 	x; //y;		

	type	uniform;
	nPoints 1000;
	axis 	distance; //y;	

	start		(	-0.1	0	0	);
	end		(	2	0	0	);				
    }
*/
);

// *********************************************************************** //
